
&НаСервере
Процедура СформироватьОтчетНаСервере()
	Об = РеквизитФормыВЗначение("Отчет");
	Макет = Об.ПолучитьМакет("Макет");
	
	ТабРезультат.Очистить();
	
	Область = Макет.ПолучитьОбласть("Шапка|Начало");
	Область.Параметры.ДатаОтчета = "На дату: "+Формат(НаДату, "ДФ=дд.ММ.гггг");
	ТабРезультат.Вывести(Область);
	
	
	//выполняем запрос, который все продажи собирает в одну таблицу
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоГода(НаДату));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(НаДату));
	
	Запрос.УстановитьПараметр("ЕстьОрганизация", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.УстановитьПараметр("ЕстьКонтрагент", ЗначениеЗаполнено(Контрагент));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	Рег.Период КАК Период,
	|	Рег.Организация КАК Организация,
	|	Рег.Контрагент КАК Контрагент,
	|	Рег.СебестоимостьОборот КАК Себестоимость,
	|	Рег.ОбъемПродажОборот КАК ОбъемПродаж
	|ПОМЕСТИТЬ ВТПродажи
	|ИЗ
	|	РегистрНакопления.ДЭТК_Продажи.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Месяц,
	|			ВЫБОР
	|					КОГДА &ЕстьОрганизация
	|						ТОГДА Организация = &Организация
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ЕстьКонтрагент
	|						ТОГДА Контрагент = &Контрагент
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК Рег";
	
	Запрос.Выполнить();
	
	//выбрать из таблицы продаж месяцы, чтобы построить шапку макета
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.Период КАК Период
	|
	|ИЗ
	|	ВТПродажи КАК ВТ
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Период";
	
	Рез = Запрос.Выполнить();
	
	//выгрузим этот запрос в таблицу, она потом пригодится
	ТЗПериодов = Рез.Выгрузить();
	ТЗПериодов.Индексы.Добавить("Период");
	
	//поля для накопления итогов для подвала
	ТЗПериодов.Колонки.Добавить("ОбъемПродажТотал", Новый ОписаниеТипов("Число"));
	ТЗПериодов.Колонки.Добавить("СебестоимостьТотал", Новый ОписаниеТипов("Число"));
	
	
	сч = 1;
	Для Каждого СтрокаПериод Из ТЗПериодов Цикл
		
		Область = Макет.ПолучитьОбласть("Шапка|Месяц");
		Область.Параметры.Месяц = Формат(СтрокаПериод.Период, "ДФ=ММММ");
		
		Область.Область("R5C1:R6C3").ЦветФона = ФормулаЦвета(сч);
		ТабРезультат.Присоединить(Область);
		
		сч=сч+1;
	КонецЦикла;
	
	
	//выбрать контрагентов и обороты по ним. продажи будут присоединяться к таблице периодов, чтобы 
	//в случае отсутствия оборотов в запросе все же был этот период
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Период КАК Период,
	|	ВТ.Контрагент КАК Контрагент,
	|	СУММА(ВТ.Себестоимость) КАК Себестоимость,
	|	СУММА(ВТ.ОбъемПродаж) КАК ОбъемПродаж
	|ИЗ
	|	ВТПродажи КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Период,
	|	ВТ.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Период
	|ИТОГИ
	|	СУММА(Себестоимость),
	|	СУММА(ОбъемПродаж)
	|ПО
	|	Контрагент, 
	|	Период ПЕРИОДАМИ (МЕСЯЦ, &ДатаНач, &ДатаКон)";
	
	
	Рез = Запрос.Выполнить();	
	
	//ТЗЗЗЗ = Рез.Выгрузить();
	//
	//ДЗЗЗЗ = Рез.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Выборка = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		//обход контрагентов
		Область = Макет.ПолучитьОбласть("Строка|Начало");
		Область.Параметры.Контрагент = Выборка.Контрагент;
		ТабРезультат.Вывести(Область);
		
		//"ВСЕ" - означет, что нужно выбрать все период, т.е. в нашем случае, с января по декабрь.
		//но нам это не надо, т.к. незачем выводить те периоды, когда совсем не было оборотов ни у одного контрагента
		//чтобы убрать лишние периоды, будем проверять наличие периода в таблице ТЗПериодов , если там такого периода нет,
		//не будем его выводить здесь
		//возможные проблемы. пример.
		//если будут обороты за февраль, апрель, июнь, то отчет не выведет март и май, т.к. их не будет в таблице ТЗПериодов.
		//это не смертельно, но некрасиво
		
		Выборка2 = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
		
		сч=1;
		Пока Выборка2.Следующий() Цикл
			
			//если в ТЗПериодов такого периода нет, то не надо выводить данные по нему, в т.ч. пустые
			Если ТЗПериодов.Найти(Выборка2.Период, "Период")=Неопределено Тогда
				Продолжить;				
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("Строка|Месяц");
			Область.Параметры.ОбъемПродаж = Выборка2.ОбъемПродаж;
			Область.Параметры.Себестоимость = Выборка2.Себестоимость;
			Попытка
				Область.Параметры.Рентабельность = ?(Выборка2.Себестоимость=0, 0, (Выборка2.ОбъемПродаж-Выборка2.Себестоимость)/Выборка2.Себестоимость*100);
			Исключение
			КонецПопытки;
			
					
			Область.Область("R1C1:R1C3").ЦветФона  = ФормулаЦвета(сч);
			ТабРезультат.Присоединить(Область);
			
			СтрТотал = ТЗПериодов.Найти(Выборка2.Период, "Период");
			
			Попытка
				СтрТотал.ОбъемПродажТотал = СтрТотал.ОбъемПродажТотал + Выборка2.ОбъемПродаж;
			Исключение
			КонецПопытки;
			
			Попытка
				СтрТотал.СебестоимостьТотал = СтрТотал.СебестоимостьТотал + Выборка2.Себестоимость;
			Исключение
			КонецПопытки;
			
			
			сч=сч+1;
			
		КонецЦикла;
		
		
	КонецЦикла;
	
	
	
	//подвал
	
	Область = Макет.ПолучитьОбласть("Подвал|Начало");
	ТабРезультат.Вывести(Область);

	сч = 1;
	Для Каждого СтрокаПериод Из ТЗПериодов Цикл
		
		Область = Макет.ПолучитьОбласть("Подвал|Месяц");
		Область.Параметры.ОбъемПродаж = СтрокаПериод.ОбъемПродажТотал;
		Область.Параметры.Себестоимость = СтрокаПериод.СебестоимостьТотал;
		Область.Параметры.Рентабельность = ?(СтрокаПериод.СебестоимостьТотал=0, 0, (СтрокаПериод.ОбъемПродажТотал-СтрокаПериод.СебестоимостьТотал)/СтрокаПериод.СебестоимостьТотал*100);
		
				
		Область.Область("R1C1:R1C3").ЦветФона  = ФормулаЦвета(сч);
		ТабРезультат.Присоединить(Область);
		
		сч=сч+1;
	КонецЦикла;
	
	
	
	
	//завершение
	ТабРезультат.Защита = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФормулаЦвета(сч)
	//доделать. цвет потом наверно нужно сделать фиксированный для каждого месяца
	Возврат Новый Цвет(120+сч*10, 120+сч*25, 110)
КонецФункции
